let player = new cplayer({
          element: document.getElementById('app'),
          zoomOutKana: true,
          dark: true,
          volume: 0.50,
          autoplay: true,
          playlist: [
            {
              src: 'http://music.163.com/song/media/outer/url?id=2093562354.mp3',
              poster: 'https://p1.music.126.net/2vTe0rWLeFRnMn58DdXOMA==/109951167360559260.jpg?param=300y300',
              name: '纸飞机.',
              artist: 'GooGo / 王只睿',
              lyric: "[00:17.04]我的纸飞机呀飞呀飞\n[00:20.67]飞到了芦荡边\n[00:23.85]带我去看落日晚霞\n[00:27.03]还有开满花的田野\n[00:30.21]我的纸飞机呀飞呀飞\n[00:33.39]飞到了我的童年\n[00:36.57]那时的母亲还没长出白发\n[00:39.75]人群中如此耀眼\n[00:42.93]飞呀飞呀\n[00:46.11]飞呀飞呀\n[00:49.29]代替我去看看我的家乡\n[00:52.47]飞呀飞呀\n[00:55.65]飞呀飞呀\n[00:58.83]再慢些吧\n[01:02.01]再让我慢一些长大Woo\n[01:05.19]就让你指引我前方的路\n[01:08.37]Woo\n[01:11.55]我做了一个梦\n[01:13.14]在梦里回到小时候\n[01:14.73]那时感受不到生活的痛\n[01:16.32]还有天真才有的执拗\n[01:17.91]光着屁股跑去巷尾\n[01:19.50]站在门口跟她犟嘴\n[01:21.09]同样的歌谣我继续再唱会\n[01:22.68]踩过池塘边的浪水\n[01:24.27]只顾盯着我的小灵通\n[01:25.86]没写完作业他催促的追\n[01:27.45]老爷看着他的小屏风\n[01:29.04]多年之后上面也积了灰\n[01:30.63]以为长大自己能够担着天\n[01:32.22]原来如此渺小碰不到边\n[01:33.81]当我推开门时发现他已经弯了肩\n[01:35.40]桌上摆着那张再也回不去的老照片\n[01:36.99]我的纸飞机呀飞呀飞\n[01:40.17]飞到了芦荡边\n[01:43.35]带我去看落日晚霞\n[01:46.53]还有开满花的田野\n[01:49.71]我的纸飞机呀飞呀飞\n[01:52.89]飞到了我的童年\n[01:56.07]那时的母亲还没长出白发\n[01:59.25]人群中如此耀眼\n[02:02.43]飞呀飞呀\n[02:05.61]飞呀飞呀\n[02:08.79]代替我去看看我的家乡\n[02:11.97]飞呀飞呀\n[02:15.15]飞呀飞呀\n[02:18.33]再慢些吧\n[02:21.51]再让我慢一些长大Woo\n[02:24.69]就让你指引我前方的路\n[02:27.87]Woo\n[02:31.05]我的纸飞机呀飞的越来越远\n[02:34.23]背井离乡迷了路\n[02:37.41]直到大雨无情将它冲刷\n[02:40.59]想起那条回不去的路\n[02:43.77]我的纸飞机呀飞的越来越远\n[02:46.95]为了梦想而奔波\n[02:50.13]弄丢的时光一去不复返\n[02:53.31]无法回头"
            },
            {
              src: 'http://music.163.com/song/media/outer/url?id=229072.mp3',
              poster: 'https://p1.music.126.net/eF6W74HxjPxUwU51ohn60w==/109951168023389683.jpg?param=300y300',
              name: '避风港',
              artist: '冯曦妤',
              lyric: "[00:13.00]习惯躲在你怀里 像避风港\n[00:18.00]不管外面风浪 有你就不慌\n[00:23.00]你给的安全感 像温暖阳光\n[00:28.00]把所有不安 都慢慢驱散\n[00:33.00]你总笑着对我说 有我就好\n[00:38.00]简单一句承诺 比什么都重要\n[00:43.00]有你在的地方 就是我的家\n[00:48.00]再大的风雨 也不会害怕\n[00:53.00]你是我的避风港 是我的方向\n[00:58.00]牵着你的手 就不会迷茫\n[01:03.00]你是我的避风港 守护我成长\n[01:08.00]这份爱 永远都不会忘\n[01:13.00]谢谢你 一直在我身旁\n[01:18.00]让我勇敢 去追逐梦想\n[01:23.00]有你在 心就不会流浪\n[01:28.00]这份爱 温暖我的时光"
            },
            {
              src: 'https://music.163.com/song/media/outer/url?id=86369.mp3',
              poster: 'https://p4.music.126.net/tdBhA4_YvSfaJBfBUtJAFQ==/109951167870491074.jpg?param=300y300',
              name: '偏爱',
              artist: '张芸京',
              lyric: "[00:00.00]把昨天都作废 现在你在我眼前\n[00:04.00]我想爱 请给我机会\n[00:08.00]如果我错了也承担 认定你就是答案\n[00:12.00]我不怕谁嘲笑我极端\n[00:16.00]相信自己的直觉 顽固的人不喊累\n[00:20.00]爱上你 我不撤退\n[00:24.00]我说过 我不闪躲 我非要这么做\n[00:28.00]讲不听 也偏要 更努力爱\n[00:32.00]让你明白\n[00:34.00]没有别条路能走 你决定要不要陪我\n[00:38.00]讲不听 偏爱 靠我感觉爱\n[00:42.00]等你的依赖 对你偏爱\n[00:47.00]痛也很愉快"
            },
            {
              src: 'https://music.163.com/song/media/outer/url?id=1903149553.mp3',
              poster: 'https://p3.music.126.net/W35p4QxHFsDoQJSH45Lrjg==/109951168153944857.jpg?param=300y300',
              name: '无名的人',
              artist: '毛不易',
              lyric: "[00:00.00]我是这路上 没名字的人\n[00:04.00]我没有新闻 没有人评论\n[00:08.00]要拼尽所有 换得普通的剧本\n[00:12.00]曲折辗转 不过谋生\n[00:16.00]我是站在 风雪里的人\n[00:20.00]我握着车票 一转身要离分\n[00:24.00]敬你 我 平凡的一生\n[00:28.00]敬我 山河里的 每份认真\n[00:32.00]我是无名的人 平凡的人\n[00:36.00]却在生活里 活得认真\n[00:40.00]哪怕满身伤痕 也不低头\n[00:44.00]努力活成 一束光\n[00:48.00]我是无名的人 普通的人\n[00:52.00]也在风雨中 撑着一盏灯\n[00:56.00]走过岁月漫长 终会抵达\n[01:00.00]心中那片 温暖的城"
            },
            {
              src: 'https://music.163.com/song/media/outer/url?id=573968836.mp3',
              poster: 'https://p4.music.126.net/JaE9FykaLU8dRSbNlucbZg==/109951163538935511.jpg?param=300y300',
              name: '春泥',
              artist: '庾澄庆',
              lyric: "[00:13.00]漫天的话语 纷乱落在耳际\n[00:19.00]你我沉默不回应\n[00:25.00]牵你的手 你却哭红了眼睛\n[00:31.00]路途漫长无止尽\n[00:37.00]多想提起勇气 好好地呵护你\n[00:43.00]不让你受委屈 苦也愿意\n[00:49.00]那些痛的记忆 落在春的泥土里\n[00:55.00]滋养了大地 开出下一个花季\n[01:01.00]风中你的泪滴 滴滴落在回忆里\n[01:07.00]让我们取名叫做珍惜\n[01:13.00]迷雾散尽 一切终于变清晰\n[01:19.00]爱与痛都成回忆\n[01:25.00]遗忘过去 繁花灿烂在天际\n[01:31.00]等待已有了结局\n[01:37.00]我会提起勇气 好好地呵护你\n[01:43.00]不让你受委屈 苦也愿意\n[01:49.00]那些痛的记忆 落在春的泥土里\n[01:55.00]滋养了大地 开出下一个花季\n[02:01.00]风中你的泪滴 滴滴落在回忆里\n[02:07.00]让我们取名叫做珍惜"
            }
          ]
        })
        function playMusic() {
            player.play()
            document.removeEventListener('click', playMusic);
        }
        document.addEventListener('click', playMusic);
